const obj = {
    code: 0,
    message: 'ok',
    data: {
        title: '新時代 (ウタ from ONE PIECE FILM RED)（动画电影《航海王：红发歌姬》主题曲，新时代）',
        author: '中田ヤスタカ',
        duration: '03:46',
        headerpic: 'https://p2.music.126.net/wMA0yyEt_LTnQ-gpLj1muQ==/109951168311441461.jpg?imageView=1&type=webp&thumbnail=84x0',
        pic: 'https://p2.music.126.net/p23zVOIAEPie-innyb6MUg==/109951167764758053.jpg?imageView&thumbnail=360y360&quality=75&tostatic=0',
        audio: 'https://m801.music.126.net/20230626101413/627b4143a2712d538ac8735f8092ffee/jdyyaac/obj/w5rDlsOJwrLDjj7CmsOj/20039035960/1f9e/264e/ec16/8d0d06ba96c04eb36209a2c50af06e88.m4a',
        lyric: '[00:00.000] 作词 : 中田ヤスタカ\n[00:00.40] 作曲 : 中田ヤスタカ\n[00:01.051]新時代はこの未来だ\n[00:05.098]世界中全部 変えてしまえば\n[00:13.082]変えてしまえば\n[00:21.265]\n[00:44.716]ジャマモノ やなもの なんて消して\n[00:47.507]この世とメタモルフォーゼしようぜ\n[00:50.178]ミュージック\n[00:51.964]キミが起こす マジック\n[00:54.383]\n[00:55.690]目を閉じれば未来が開いて\n[00:58.523]いつまでも終わりが来ないようにって\n[01:02.762]この歌を歌うよ\n[01:06.792]\n[01:06.987]Do you wanna play? リアルゲーム ギリギリ\n[01:09.569]綱渡りみたいな旋律\n[01:12.619]認めない戻れない忘れたい\n[01:15.230]夢の中に居させて I wanna be free\n[01:19.610]見えるよ新時代が 世界の向こうへ\n[01:25.079]さあ行くよ NewWorld\n[01:27.983]\n[01:28.691]新時代はこの未来だ\n[01:31.477]世界中全部 変えてしまえば\n[01:35.941]変えてしまえば\n[01:39.641]果てしない音楽がもっと届くように\n[01:44.178]夢は見ないわ キミが話した\n[01:49.479]「ボクを信じて」\n[01:51.302]\n[02:12.392]あれこれいらないものは消して\n[02:15.189]リアルをカラフルに越えようぜ\n[02:17.916]ミュージック\n[02:19.614]今始まる ライジング\n[02:21.966]\n[02:23.352]目をつぶりみんなで逃げようよ\n[02:26.164]今よりイイモノを見せてあげるよ\n[02:30.811]この歌を歌えば\n[02:34.461]\n[02:34.870]Do you wanna play? リアルゲーム ギリギリ\n[02:37.286]綱渡りみたいな運命\n[02:40.410]認めない戻れない忘れたい\n[02:42.815]夢の中に居させて I wanna be free\n[02:47.258]見えるよ新時代が 世界の向こうへ\n[02:52.696]さあ行くよ NewWorld\n[02:55.578]\n[02:56.412]新時代わ この未来を\n[02:59.082]世界中全部 変えてしまえば 変えてしまえば\n[03:07.572]果てしない音楽がもっと届くように\n[03:11.953]夢を見せるよ 夢を見せるよ\n[03:17.515]新時代だ\n[03:19.044]\n[03:39.253]新時代だ\n',
        lyricCN: '[00:00.000] \n[00:00.525] \n[00:01.051]新时代便是这未来\n[00:05.098]倘若能改变这世界的一切\n[00:13.082]倘若能够改变\n[00:21.265]\n[00:44.716]碍事与厌恶的事物尽数消除\n[00:47.507]将这个世界尽数改变吧\n[00:50.178]音乐\n[00:51.964]便是你所引发的魔法\n[00:54.383]\n[00:55.690]闭上双目未来将会展开\n[00:58.523]终末将不再到来\n[01:02.762]歌唱这首歌吧\n[01:06.792]\n[01:06.987]你是否想游玩？挑战这现实游戏的极限\n[01:09.569]就像冒险般的旋律\n[01:12.619]不想承认无法回头想要忘却\n[01:15.230]让我身处梦中吧 我渴望自由\n[01:19.610]已能看到 新时代就在世界的那一侧\n[01:25.079]走吧 一起去新世界\n[01:27.983]\n[01:28.691]新时代便是这未来\n[01:31.477]倘若能改变这世界的一切\n[01:35.941]倘若能够改变\n[01:39.641]希望这无止境的音乐能够传达更远\n[01:44.178]我不会沉溺梦境 因为你说过\n[01:49.479]「请相信我」\n[01:51.302]\n[02:12.392]将那些不需之物消除\n[02:15.189]超越现实的色彩吧\n[02:17.916]音乐\n[02:19.614]现在开始崛起\n[02:21.966]\n[02:23.352]闭上双眼大家一起逃跑吧\n[02:26.164]去见证比如今更棒的世界吧\n[02:30.811]倘若歌唱这首歌\n[02:34.461]\n[02:34.870]你是否想游玩？挑战这现实游戏的极限\n[02:37.286]就像冒险般的命运\n[02:40.410]不想承认无法回头也想要忘却\n[02:42.815]让我身处梦中吧 我渴望自由\n[02:47.258]已能看到 新时代就在世界的那一侧\n[02:52.696]走吧 一起去新世界\n[02:55.578]\n[02:56.412]坚信的便是这未来\n[02:59.082]倘若能改变这世界的一切 倘若能够改变\n[03:07.572]为让这无止境的音乐能够传达更远\n[03:11.953]一同进入梦境吧 进入梦境吧\n[03:17.515]进入新时代\n[03:19.044]\n[03:39.253]新时代\n'
    }
}
const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}